## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 80 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dependencytrack_api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dependencytrack_api_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.template_file.dependencytrack_api_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "dependencytrack_api_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 4096
                  + environment      = [
                      + {
                          + name  = "ALPINE_DATABASE_MODE"
                          + value = "external"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_URL"
                          + value = "${ALPINE_DATABASE_URL}"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER"
                          + value = "org.postgresql.Driver"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER_PATH"
                          + value = "/extlib/postgresql-42.2.5.jar"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MAX_SIZE"
                          + value = "20"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MIN_IDLE"
                          + value = "10"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_IDLE_TIMEOUT"
                          + value = "300000"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MAX_LIFETIME"
                          + value = "600000"
                        },
                    ]
                  + essential        = true
                  + image            = "dependencytrack/apiserver:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/data"
                          + readOnly      = false
                          + sourceVolume  = "${DEPENDENCYTRACK_SERVICE_NAME}"
                        },
                    ]
                  + name             = "${DEPENDENCYTRACK_SERVICE_NAME}"
                  + portMappings     = [
                      + {
                          + ContainerPort = 8080
                          + Protocol      = "tcp"
                          + hostPort      = 8080
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "ALPINE_DATABASE_USERNAME"
                          + valueFrom = "${ALPINE_DATABASE_USERNAME}"
                        },
                      + {
                          + name      = "ALPINE_DATABASE_PASSWORD"
                          + valueFrom = "${ALPINE_DATABASE_PASSWORD}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "ALPINE_DATABASE_PASSWORD"     = (known after apply)
          + "ALPINE_DATABASE_URL"          = (known after apply)
          + "ALPINE_DATABASE_USERNAME"     = (known after apply)
          + "AWS_LOGS_GROUP"               = "/aws/ecs/dependencytrack_api"
          + "AWS_LOGS_REGION"              = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"       = "dependencytrack_api-task"
          + "DEPENDENCYTRACK_API_IMAGE"    = "dependencytrack/apiserver:4.4.2@sha256:584cfd2349ec93cfde2528b8f34bd5d3a9f0a393fa38806128d646743fa649ee"
          + "DEPENDENCYTRACK_SERVICE_NAME" = "dependencytrack_api"
        }
    }

  # data.template_file.dependencytrack_frontend_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "dependencytrack_frontend_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "API_BASE_URL"
                          + value = "https://api.dependencies.security.cdssandbox.xyz"
                        },
                    ]
                  + essential        = true
                  + image            = "${DEPENDENCYTRACK_FRONTEND_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "${DEPENDENCYTRACK_FRONTEND_SERVICE_NAME}"
                  + portMappings     = [
                      + {
                          + ContainerPort = 8080
                          + Protocol      = "tcp"
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "AWS_LOGS_GROUP"                        = "/aws/ecs/dependencytrack_frontend"
          + "AWS_LOGS_REGION"                       = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"                = "dependencytrack_frontend-task"
          + "DEPENDENCYTRACK_FRONTEND_IMAGE"        = "dependencytrack/frontend:4.4.0@sha256:e0b6790c19cba4470468a5cbd8eaaf80c8b9cd4c3c9be5b993032fbec5ed0daa"
          + "DEPENDENCYTRACK_FRONTEND_SERVICE_NAME" = "dependencytrack_frontend"
        }
    }

  # aws_cloudwatch_log_group.dependencytrack_api will be created
  + resource "aws_cloudwatch_log_group" "dependencytrack_api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/dependencytrack_api"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.dependencytrack_frontend will be created
  + resource "aws_cloudwatch_log_group" "dependencytrack_frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/dependencytrack_frontend"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_ecs_cluster.software_asset_tracking will be created
  + resource "aws_ecs_cluster" "software_asset_tracking" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "software_asset_tracking"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.dependencytrack_api will be created
  + resource "aws_ecs_service" "dependencytrack_api" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dependencytrack_api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "dependencytrack_api"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.dependencytrack_frontend will be created
  + resource "aws_ecs_service" "dependencytrack_frontend" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dependencytrack_frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "dependencytrack_frontend"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.dependencytrack_api will be created
  + resource "aws_ecs_task_definition" "dependencytrack_api" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "4096"
      + execution_role_arn       = (known after apply)
      + family                   = "dependencytrack_api"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)

      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = (known after apply)
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = (known after apply)
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # aws_ecs_task_definition.dependencytrack_frontend will be created
  + resource "aws_ecs_task_definition" "dependencytrack_frontend" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "dependencytrack_frontend"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_efs_access_point.dependencytrack will be created
  + resource "aws_efs_access_point" "dependencytrack" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/data"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "775"
            }
        }
    }

  # aws_efs_file_system.dependencytrack will be created
  + resource "aws_efs_file_system" "dependencytrack" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + throughput_mode         = "bursting"
    }

  # aws_efs_mount_target.dependencytrack[0] will be created
  + resource "aws_efs_mount_target" "dependencytrack" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_flow_log.cloud-based-sensor will be created
  + resource "aws_flow_log" "cloud-based-sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-794722365809/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_policy.dependencytrack_api_policies will be created
  + resource "aws_iam_policy" "dependencytrack_api_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "DependencytrackAPIContainerExecutionPolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow writing WAF logs to S3 + CloudWatch"
      + id          = (known after apply)
      + name        = "security-tools-software-asset-inventory_WriteLogs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-794722365809/*"
                      + Sid      = "S3PutObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.dependencytrack_api_container_execution_role will be created
  + resource "aws_iam_role" "dependencytrack_api_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dependencytrack_api_container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.dependencytrack_frontend_container_execution_role will be created
  + resource "aws_iam_role" "dependencytrack_frontend_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dependencytrack_frontend_container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.dependencytrack_task_execution_role will be created
  + resource "aws_iam_role" "dependencytrack_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dependencytrack_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.waf_log_role will be created
  + resource "aws_iam_role" "waf_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security-tools-software-asset-inventory-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cloudwatch_policies will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "dependencytrack_execution_role"
    }

  # aws_iam_role_policy_attachment.dependencytrack_api_ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "dependencytrack_api_ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
